In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1 = {"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
           "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori":[100,200,300,400]
          }

In [3]:
dataFrame1 = pd.DataFrame(sozluk1, index=[0,1,2,3])

In [4]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [5]:
sozluk2 = {"Isim":["Osman","Levent","Atlas","Fatma"],
           "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori":[200,100,50,300]
          }

In [7]:
dataFrame2 = pd.DataFrame(sozluk2,index=[4,5,6,7])

In [8]:
sozluk3 = {"Isim":["Ayse","Mahmut","Duygu","Nur"],
           "Spor":["Koşu","Yüzme","Badminton","Tenis"],
           "Kalori":[300,400,500,250]
          }

In [9]:
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [10]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [11]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## concatenation

In [12]:
# Birleştirme anlamına gelir ama birleştirirken altalta ya da yanyana getirir.
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

In [14]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

In [15]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=1)

,Isim,Spor,Kalori,Isim,Spor,Kalori,Isim,Spor,Kalori
0,Ahmet,Koşu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Mehmet,Yüzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Zeynep,Koşu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Atıl,Basketbol,400.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Osman,Koşu,200.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Levent,Yüzme,100.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Atlas,Koşu,50.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Fatma,Basketbol,300.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Ayse,Koşu,300.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Mahmut,Yüzme,400.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Duygu,Badminton,500.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Nur,Tenis,250.0

## merge

In [16]:
mergeSozluk1 = {"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor":["Koşu","Yüzme","Koşu","Basketbol"]
               }

In [17]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [18]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [19]:
mergeSozluk2 = {"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori":[100,200,150,250]
               }

In [20]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [21]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [22]:
# merge yani birleştirme işlemi yaparken on ile ortak bir kolon seçip o ortak kolon üzerinden işlemlerimizi yaparız. 
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [23]:
# Diyelim ki bir veri setimiz var ve bunun içerisinden tekrar etmeyen değerleri almak istiyoruz.
maasSozluk = {"Isim":["Atıl","Zeynep","Mehmet","Ahmet"],
             "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas":[200,300,400,500]
             }

In [24]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [25]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [26]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [27]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [28]:
maasDataFrame["Departman"].nunique()

3

In [29]:
# value_counts() ile hangi departmandan kaç kişi olduğunu görürüz:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [32]:
def bruttenNete(maas):
    return maas * 0.66

In [33]:
maasDataFrame["Maas"]

0    200
1    300
2    400
3    500
Name: Maas, dtype: int64

In [34]:
# .apply(fonkIsmi) ile fonkiyonları kolay bir şekilde uygularız:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [35]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [36]:
# pivot table : Excelde kullandığımız bir özellik.
# Farklı farklı parametreleri alıp özet tablolar oluşturmamıza yardım eden yapıdır.
yeniBirVeri = {"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Ismi":["Cartman","Kenny","Homer","Bart","Bart"],
               "Karakter Puanı":[9,10,50,20,10]
              }

In [37]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [38]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Puanı
0      South Park       Cartman               9
1      South Park         Kenny              10
2         Simpson         Homer              50
3         Simpson          Bart              20
4         Simpson          Bart              10

In [39]:
karakterDF.pivot_table(values = "Karakter Puanı", index = ["Karakter Sınıfı","Karakter Ismi"])

                               Karakter Puanı
Karakter Sınıfı Karakter Ismi
Simpson         Bart                       15
                Homer                      50
South Park      Cartman                     9
                Kenny                      10

In [40]:
karakterDF.pivot_table(values = "Karakter Puanı", index = ["Karakter Sınıfı","Karakter Ismi"],aggfunc=np.sum)

                               Karakter Puanı
Karakter Sınıfı Karakter Ismi
Simpson         Bart                       30
                Homer                      50
South Park      Cartman                     9
                Kenny                      10